app/views/static_pages/gossip.html.erb

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 45], ["LIMIT", 1]]
---
<!--recuperation des données sur id-->
    <h1 class="display-3">Titre : <%= Gossip.find(params[:id]).title %> </h1>
        <p class="lead"> Contenue : <%= Gossip.find(params[:id]).content %> </p>

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 37], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
---
            <font color="white">
                <%= User.find(Gossip.find(params[:id]).user_id).first_name %>

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 37], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
---
            <font color="lightgreen" face="Purisa">Last Name :  </font>
                <%= User.find(Gossip.find(params[:id]).user_id).last_name %>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 37], ["LIMIT", 1]]
---
        <p class="lien">
            <center><%= link_to "Voir le profil !!", "../user/#{Gossip.find(params[:id]).user_id}" %></center>