app/views/static_pages/home.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
---
                <div class="card text-white bg-secondary mb-3" style="width: 20rem;">
                    <div class="card-header"><%= User.find(gossip.user_id).first_name %><%= User.find(gossip.user_id).last_name %>  </div>